GetBackground Method
 Returns the current background set for the view.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  Since:  2014
 Syntax
  C#
public ViewDisplayBackground GetBackground()
  Visual Basic
Public Function GetBackground As ViewDisplayBackground
  Visual C++
public:
ViewDisplayBackground^ GetBackground()
 Return Value
 Current background.
 See Also
  View Class
  Autodesk.Revit.DB Namespace
 ArchiLabs
Stop fighting Revit automation.
Build repeatable BIM design and documentation workflows with scripts, data, and AI in one place, without wrestling brittle one-off automations.
 Try ArchiLabs →